Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-IT/tmx_teil_2.tmx
Source language: en
Languages: it

source: Rollers [tractor towed agricultural implements]
it: Rulli [strumenti agricoli trainati da trattori]

source: Water separators [machines]
it: Separatori dell'acqua [macchine]

source: Anti-swinging brakes for crane forks
it: Freni anti-oscillazione per forche per gru

source: Disc brakes being parts of machines
it: Freni a disco che sono parti di macchine

source: Disc shaped rotating grinding tools [parts for machines]
it: Utensili per molare rotanti a forma di disco [parti di macchine]

source: Pressing machines
it: Presse [macchine]

source: Hoses (Non-metallic -) for use in hydraulic systems in machines
it: Tubi flessibili (Non metallici -) per impianti idraulici di macchine

source: Kitchen machines (Electric -) for food preparation [other than cooking]
it: Macchine da cucina (Elettriche -) per la preparazione del cibo [non per cottura]

source: Spiked rollers [machines]
it: Rulli a spuntoni [macchine]

source: Pipe induction bending machines
it: Macchine piegatubi a induzione

source: Lasts for shoes [parts of machines]
it: Forme per calzature [parti di macchine]

source: Self-priming centrifugal pumps
it: Pompe centrifughe autoadescanti

source: Rolling machines for rolling metals
it: Rullatrici per la laminazione dei metalli

source: Electric alternators for water vehicles
it: Alternatori elettrici per veicoli nautici

source: Starting couplings for machines
it: Giunti di avviamento per macchine

source: Vacuum control valves [parts of machines]
it: Valvole di controllo del vuoto [parti di macchine]

source: Valve diaphragms
it: Valvole a diaframma

source: Valves operated automatically by hydraulic control
it: Valvole azionate automaticamente mediante comando idraulico

source: Moulds for forging metal products [parts of machines]
it: Stampi per forgiatura di prodotti metallici [parti di macchine]

source: Sprayers (knapsack -) [electric] for carrying on the back
it: Irroratrici (a zaino -) [elettriche] da portare sulla schiena

source: Conveyors for use in mines
it: Convogliatori per uso in miniere

source: Electronic starters for engines
it: Avviatori elettronici per motori

source: Jacquard controlled knitting machines
it: Macchine per maglieria a comando Jacquard

source: Jacquard controls
it: Comandi Jacquard

source: Jaw type shaft couplings other than for land vehicles
it: Giunti di alberi a ganasce non per veicoli terrestri

source: Splines (square -) [parts of machines]
it: Scanalature (quadrate -) [parti di macchine]

source: Spray prevention guards for machines
it: Protezioni anti-spruzzo per macchine

source: Stone hammers [machines]
it: Schiacciasassi [macchine]

source: Multiple function hand-held screwdrivers (Electric -)
it: Cacciaviti manuali multifunzionali (Elettrici -)

source: Gearing for air vehicles
it: Ingranaggi per veicoli aerei

source: Generating sets for use with engines
it: Gruppi elettrogeni per uso con motori

source: Weft straighteners [machines]
it: Raddrizzatrama [macchina]

source: Regulators for use in welding machines
it: Regolatori per macchine per la saldatura

source: Drive pulleys
it: Pulegge motrici

source: Drive pulleys for power transmission belts of agricultural machines
it: Pulegge per cinghie di trasmissione di potenza per macchine agricole

source: Drive transmissions, other than for land vehicles
it: Trasmissioni, non per veicoli terrestri

source: Ground boring machines
it: Macchine di trivellazione

source: Industrial cleaning machines
it: Macchine pulitrici industriali

source: Roll forming machines
it: Profilatrici a rulli

source: Roller installations for brake testing
it: Impianti a rulli per verifica dei freni

source: Flexographic printing plates
it: Tavole per la stampa flessografica

source: Dressers for blades [machine tool]
it: Ravviva-lame [macchina utensile]

source: Swimming pool cleaning machines
it: Macchine per la pulizia di piscine

source: Tape readers for use with embroidery machines
it: Lettori di nastri per macchine da ricamo

source: Machines for mixing asphalt
it: Macchine per mescolare asfalto

source: Single spindle drilling machines
it: Trapanatrici a fuso singolo

source: Skid steer loaders
it: Minipale compatte

source: Sleeve type linear ball bearings for use in linear movement
it: Cuscinetti a sfera lineari a guaina per movimento lineare

source: Sludge valves being parts of machines
it: Valvole per liquami che sono parti di macchine

source: Haulage apparatus [mining]
it: Estrattori [miniere]

source: Kneading machines [for chemical processing]
it: Impastatrici meccaniche [per trattamento chimico]

source: Abrasive belts for power-operated sanders
it: Cinghie abrasive per smerigliatrici a motore

source: Suction nozzles for vacuum cleaners
it: Bocchette di aspirazione per aspirapolveri

source: Stacking machines [other than fork-lift trucks]
it: Macchine impilatrici [non carrelli elevatori a forca]

source: Rabetting planes [machines]
it: Pialle per scanalature [macchine]

source: Workpiece clamping attachments [machines]
it: Morsetti di serraggio dei pezzi [macchine]

source: Workpiece clamping attachments [parts of machines]
it: Morsetti di serraggio dei pezzi [parti di macchine]

source: Agricultural machines for ground cultivation
it: Macchine agricole per la coltivazione del terreno

source: Alternating current servo motors
it: Servomotori a corrente alternata

source: Power-operated lawn aerators
it: Frangizolle per prati a motore

source: Power-operated lawn edgers
it: Tagliabordi a motore

source: Scarifying machines for garden use
it: Macchine scarificatrici da giardino

source: Robotic apparatus for handling materials
it: Apparecchi robotici per manipolazione di materiali

source: Bolt cutters [machines]
it: Tagliabulloni [macchine]

source: Nozzles which are parts of power-operated sprayers
it: Ugelli che sono parti di spruzzatori elettrici

source: Machine coupling and transmission components (except for land vehicles)
it: Giunti e organi di trasmissione (eccetto quelli per veicoli terrestri)

source: Power operated sharpeners
it: Affilatrici a motore

source: Numerically controlled modelling machines for business use
it: Macchine modellatrici a controllo numerico per uso professionale

source: Pulleys [parts of motors]
it: Pulegge [parti di motori]

source: Steam riveting machines
it: Chiodatrici a vapore

source: Stencils for use with stencil cutting machines [other than for office use]
it: Mascherine da utilizzare con le macchine per il taglio degli stampini [non per ufficio]

source: Bushings being parts of machines
it: Boccole che sono parti di macchine

source: Machine knives
it: Lame per macchine

source: Rolling gearings [other than for land vehicles]
it: Ingranaggi a rotolamento [non per veicoli terrestri]

source: Dispensing machines [other than vending machines]
it: Macchine di erogazione [non distributori automatici]

source: Injection presses
it: Presse a iniezione

source: Installations for the bulk handling of granular materials
it: Impianti per la movimentazione di materiali granulari sfusi

source: Grinding tools [machines or parts of machines]
it: Utensili abrasivi [macchine o parti di macchine]

source: Overdrive units, other than for land vehicles
it: Unità di overdrive, non per veicoli terrestri

source: Motors for aeronautical purposes
it: Motori per uso aeronautico

source: Machines for the manufacture of moulds
it: Macchine per la fabbricazione di stampi

source: Electric vacuum cleaners
it: Aspirapolvere elettrici

source: Tubular welding electrodes [electric]
it: Elettrodi tubolari per saldatura [elettrica]

source: Pressure pipes of metal [parts of machines]
it: Condotte a pressione in metallo [parti di macchine]

source: Tillers [machines] for towing behind vehicles
it: Motocoltivatori [macchine] da rimorchiare dietro veicoli

source: Governors
it: Regolatori

source: Filters for gases [machines]
it: Filtri per i gas [macchine]

source: Filters for internal combustion engines
it: Filtri per motori a combustione interna

source: Mechanical and hydraulic lifts
it: Sollevatori meccanici e idraulici

source: Gas generators [compressors] for inflating flexible structures
it: Generatori di gas [compressori] per gonfiare strutture flessibili

source: Pedestal drilling machines
it: Perforatrici con piedestallo

source: Implements [machines] for spraying
it: Strumenti [macchine] per spruzzare

source: Industrial blowers
it: Soffianti industriali

source: Pallet stabilisation machines
it: Macchine di stabilizzazione pallet

source: Soil engaging parts for agricultural implements
it: Componenti di innesto sul terreno per attrezzi agricoli

source: Soybean reaping cutters [machines]
it: Mieti-trinciatrici per soia [macchine]

source: Mincers [electric] for household use
it: Tritatutto [elettrici] per uso domestico

source: Mining shovels [machines]
it: Pale minerarie [macchine]

source: Joints for pipes (metal -) [parts of machines]
it: Guarnizioni per tubi (in metallo -) [parti di macchine]

source: Brushes being parts of motors, generators and dynamos
it: Spazzole che sono parti di motori, di generatori e dinamo

source: Chain grinding machines
it: Rettificatrici a catena

source: Couplings for machines
it: Accoppiamenti per macchine

source: Emergency power supply generators
it: Generatori di elettricità d'emergenza

source: Engines for the generation of electricity
it: Motori per la generazione di elettricità

source: Clippers [machines]
it: Tosatrici [macchine]

source: Graphic epoxy drills [machines or parts for machines]
it: Trapani grafici epossidici [macchine o parti di macchine]

source: Machines for hoisting
it: Macchinari di sollevamento

source: Combustion engines for industrial machines
it: Motori a scoppio per macchine industriali

source: Combustion engines for water vessels
it: Motori a scoppio per imbarcazioni

source: Hydraulic turbines
it: Turbine idrauliche

source: Turbo-superchargers for engines
it: Turbocompressori per motori

source: Turbo-superchargers for land vehicle engines
it: Turbocompressori per motori di veicoli terrestri

source: Drill chucks for power drills
it: Mandrini per trapani elettrici

source: Front end loaders
it: Caricatori frontali

source: Linings for brakes [parts of machines]
it: Guarnizioni per freni [parti di macchine]

source: Lithographic printing plates for use in printing machines
it: Lastre per la stampa litografica per macchine da stampa

source: Free wheel couplings [other than for land vehicles]
it: Frizioni a ruota libera [non per veicoli terrestri]

source: Fruit grinders (Electric -)
it: Tritafrutta (Elettrici -)

source: Centrifuge separators for industrial use
it: Separatrici centrifughe per uso industriale

source: Ceramic masses being parts of motors
it: Masse in ceramica che sono parti di motori

source: Ceramic tips [tools for machines]
it: Punte in ceramica [utensili per macchine]

source: Chamfering machines
it: Macchine per smussare

source: Cutting shoes [parts of machines]
it: Scarpe taglienti [parti di macchine]

source: Cutting tools [machine] in the form of drill bits
it: Utensili da taglio [macchine] sotto forma di punte di trapano

source: Manipulating devices [machines] for industrial use
it: Dispositivi di manipolazione [macchine] per uso industriale

source: Marine pumps
it: Pompe marine

source: Automatic looms
it: Telai automatici

source: Gas-operated blow torches
it: Torce azionate a gas

source: Ball rings for machines
it: Anelli a sfere per macchine

source: Hay grippers [machines or parts of machines]
it: Pinze per fieno [macchine o parti di macchine]

source: Robotic electrical welding apparatus
it: Apparecchi per saldare elettrici robotici

source: Robotic loaders for diffusion furnaces
it: Caricatori robotici per forni a diffusione

source: Rocket motor propulsion apparatus for aircraft
it: Apparecchi di propulsione a motore a razzo per aerei

source: Wire stripping machines for removing the covering from electric cables
it: Macchine spelafili per rimozione del rivestimento di cavi elettrici

source: Saw blades for use with power tools
it: Lame per seghe per utensili elettrici

source: Gas turbine engines for sea vehicles
it: Motori a turbina a gas per veicoli marittimi

source: Gear assemblies, other than for land vehicles
it: Gruppi di ingranaggi, non per veicoli terrestri

source: Machine tools for cutting
it: Macchine utensili per taglio

source: Machines for slicing food [industrial]
it: Macchine per affettare alimenti [industriali]

source: Steam turbines [other than for land vehicles]
it: Turbine a vapore [non per veicoli terrestri]

source: Connecting rods [internal combustion engine parts]
it: Bielle [parti di motore a combustione interna]

source: Paper shredders [machines], other than for office use
it: Distruggidocumenti [macchine], non per ufficio

source: Lawnmowers [machines]
it: Tosaerba [macchine]

source: Power transmission belting for machines
it: Cinghie di trasmissione di potenza per macchine

source: Power transmission couplings for sea craft
it: Giunti di trasmissione per imbarcazioni

source: Excavators [earth moving machines]
it: Escavatori [macchine movimento terra]

source: Electric clothing pressing machines
it: Macchine elettriche per stirare il bucato

source: Electric food slicers
it: Affettatrici elettriche

source: Compressors for recovering and recycling refrigerant gases
it: Compressori per il recupero e il riciclo di gas refrigeranti

source: Sharpening machines for cutlery (Electric -)
it: Affilatrici per coltelleria (Elettriche -)

source: Threshers [agricultural implements]
it: Trebbiatrici [strumenti agricoli]

source: Windrowers [agricultural implements]
it: Mietiandanatrici [strumenti agricoli]

source: Spray paint machines
it: Spazzole ad aria

source: Traps for dust [part of machines]
it: Intercettatori per la polvere

source: Handling machines, automatic [manipulators]
it: Manipolatori industriali [macchine]

source: Electronic door closing system
it: Sistema elettronico di chiusura porte

source: Beating machines
it: Macchine per battere

source: Seaming machines
it: Aggraffatrice

source: Plates for the sintering of ceramic materials
it: Piastre per la sinterizzazione di materiali in ceramica

source: Sprung guide rails [parts of machines]
it: Binari di guida sospesi [parti di macchine]

source: Air compressors for vehicle compressed air systems
it: Compressori d'aria per impianti ad aria compressa per veicoli

source: Air filters for motorcycle engines
it: Filtri dell'aria per motori di motocicli

source: Electrodes for welding machines
it: Elettrodi per macchine per saldatura

source: Raking machines
it: Ranghinatori

source: Brushes being parts of generators
it: Spazzole che sono parti di generatori

source: Rotary steam presses, portable, for fabrics
it: Calandre a vapore per tessuti portatili

source: Rotary tables for machine tools
it: Tavole rotanti per macchine utensili

source: Vacuum cleaning machines for use in households
it: Macchine aspirapolvere per uso domestico

source: Longitudinal cutters [machines]
it: Tagliatrici longitudinali [macchine]

source: Fuel conversion apparatus for internal combustion engines
it: Convertitori di combustibile per motori a combustione interna

source: Archimedian screws
it: Trasportatori a coclea

source: Aquarium pumps
it: Pompe per acquari

source: Cutting torches
it: Cannelli da taglio

source: Pumps for concrete
it: Pompe per calcestruzzo

source: Crimping tools [machines or parts of machines]
it: Utensili per ondulare [macchine o parti di macchine]

source: Crop spraying machines
it: Irroratrici per raccolti

source: Cutters for milling machines
it: Trance per fresatrici

source: Industrial sewing machines
it: Macchine da cucire industriali

source: Sharpening machines for tools (Electric -)
it: Affilatrici per utensili (Elettriche -)

source: Sharpening wheels [electric machines]
it: Mole per affilare [macchine elettriche]

source: Sheet fed rotary printing machines
it: Macchine rotative per stampare a foglio

source: Sheet metal separators [machines]
it: Separatori di lamiere [macchine]

source: Shock absorbing cylinders [parts of machines]
it: Cilindri ammortizzatori [parti di macchine]

source: Harrows
it: Erpici

source: Semiconductor processing machines for the manufacture of substrates
it: Macchine per la lavorazione di semiconduttori per la fabbricazione di substrati

source: Separators for liquid solutions
it: Separatori per soluzioni liquide

source: Electric motors for machines with a digital servo drive controller
it: Motori elettrici per macchine con dispositivi di comando servo-digitali

source: Polishing (machines and apparatus for -) for household purposes [electric]
it: Apparecchi e macchine elettriche per lucidare per uso domestico

source: Stapling presses [other than for surgical or stationery use]
it: Macchine per aggraffare [non per uso chirurgico o per cartoleria]

source: Control mechanisms for machines, engines or motors
it: Dispositivi di comando di macchine o di motori

source: Pneumatic shears
it: Cesoie pneumatiche

source: Electronic door openers
it: Apriporta elettronici

source: Machines for flaking dried fish meat (kezuri-bushi making machines)
it: Macchine per dividere il pesce in scaglie (macchine per preparare il kezuri-bushi)

source: Cream/milk separators
it: Separatori di panna

source: Knitting bobbins [parts of machines]
it: Bobine per maglieria [parti di macchine]

source: Catalytic converters for the exhaust gases of internal combustion engines
it: Convertitori catalitici per gas di scarico di motori a combustione interna

source: Cement mixers for the cementation of wells
it: Betoniere per la cementazione di pozzi

source: Lifting tongs for cranes
it: Pinze di sollevamento per gru

source: Linear actuators [mechanical]
it: Attuatori lineari [meccanici]

source: Circular saws being portable electric power tools
it: Seghe circolari che sono utensili elettrici portatili

source: Agricultural implements, other than hand-operated
it: Strumenti agricoli, diversi da quelli azionati manualmente

source: Grindstones [parts of machines]
it: Mole per affilare [parti di macchine]

source: Meat mincing machines [electric machines] for household use
it: Macchine per tritare la carne [macchine elettriche] per uso domestico

source: Access platforms [mechanical]
it: Piattaforme di accesso [meccaniche]

source: Collets being parts of machines
it: Colletti che sono parti di macchine

source: Dynamos
it: Dinamo

source: Cutting tools for machine centres
it: Utensili da taglio per centri di lavoro

source: Differential gear mechanisms for air vehicles
it: Meccanismi a ingranaggi differenziali per veicoli aerei

source: Planing tools [parts of machines]
it: Utensili per piallare [parti di macchine]

source: Plasma spraying machines
it: Spruzzatori al plasma

source: Tumbler gears, other than for land vehicles
it: Invertitori di marcia, non per veicoli terrestri

source: Vegetable corers [machines]
it: Scavini per verdure [macchine]

source: Vegetable peelers [machines]
it: Pelaverdure [macchine]

source: Transportation robots
it: Robot per trasporto

source: Cables for lifts
it: Cavi per ascensori

source: Electric wax-polishing machines for industrial purposes
it: Lucidatrici elettriche per uso industriale

source: Envelope-inserting machines
it: Macchine imbustatrici

source: Barrels for use with drilling machines
it: Fusti per uso con macchine di trivellazione

source: Heavy media separators [machines]
it: Separatori a mezzo denso [macchine]

source: High frequency welding machines
it: Saldatrici ad alta frequenza

source: Hydraulic valves
it: Valvole idrauliche

source: Hydraulically driven winches for marine use
it: Verricelli idraulici per uso marino

source: Central vacuum cleaning installations
it: Impianti centrali di pulizia

source: Stalk separators [machines]
it: Sgrappolatoi [macchine]

source: Motors, electric, other than for land vehicles
it: Motori elettrici diversi da quelli per veicoli terrestri

source: Dissolving machines [for chemical processing]
it: Macchine di dissolvimento [per trattamento chimico]

source: Disc harrows [tractor towed agricultural implements]
it: Erpici a dischi [strumenti agricoli trainati da trattori]

source: Anti-swinging brakes for grippers
it: Freni anti-oscillazione per pinze

source: Anti-vibration mountings for machines
it: Supporti anti-vibrazione per macchine

source: Articulated transmissions for aircraft
it: Trasmissioni articolate per aeronavi

source: Disc screens [parts of machines]
it: Setacci a disco [parti di macchine]

source: Spindle shafts [parts of engines]
it: Alberi a mandrino [parti di motori]

source: Pistons for vehicle engines
it: Pistoni per motori di veicoli

source: Pivoting bucket conveyors
it: Trasportatori a tazze a perno

source: Sealing machines for industrial purposes
it: Macchine per sigillare per uso industriale

source: Self-propelled cranes
it: Gru a propulsione autonoma

source: Self-regulating pumps [other than for the delivery of fuel at filling stations]
it: Pompe a regolazione automatica [non per l'erogazione di carburante nelle stazioni di servizio]

source: Semi-automatic strapping machines
it: Legatrici semiautomatiche

source: Stuffing boxes [parts of machines]
it: Premistoppa [parti di macchine]

source: Numerically controlled tapping machines with co-ordinate tables
it: Maschiatrici a controllo numerico con tavoli a coordinate

source: Image reproduction machines [printing]
it: Macchine per la riproduzione di immagini

source: Starters for stationary engines
it: Avviatori per motori fissi

source: Torsion bars for machines
it: Barre di torsione per macchine

source: Processing machines using processing liquids for the treatment of objects
it: Macchine di lavorazione che utilizzano liquidi di lavorazione per il trattamento di oggetti

source: Inert gas generators [machines]
it: Generatori di gas inerte [macchine]

source: Suction turbines [other than for land vehicles]
it: Turbine di aspirazione [non per veicoli terrestri]

source: Brake parts (Machine -) made of materials having frictional properties
it: Parti di freni (Per macchine -) in materiali con proprietà di attrito

source: Brakes for industrial washing machines
it: Freni per macchine lavatrici industriali

source: Sprayers (machines) for applying artificial sun tanning preparations
it: Vaporizzatori (macchine) per applicare preparati abbronzanti artificiali

source: Sprayers [machines] for household use in spraying insecticide
it: Nebulizzatori [macchine] per uso domestico per spruzzare insetticida

source: Power-operated de-thatchers
it: Scarificatori a motore

source: Vertical bucket conveyors incorporating belt bridges
it: Trasportatori verticali a tazze comprendenti ponti a nastro

source: Vibrating conveyors
it: Trasportatori vibranti

source: Hot air welding machines
it: Saldatrici ad aria calda

source: Power transmission chains
it: Catene di trasmissione

source: Power-driven wrenches
it: Avvitatrici elettriche

source: Power-operated grinding wheels
it: Mole abrasive elettriche

source: Internal combustion motors [other than for land vehicles]
it: Motori a combustione interna [non per veicoli terrestri]

source: Spools of metal [parts of machines]
it: Bobine in metallo [parti di macchine]

source: Tool bits for use in power operated hand tools
it: Punte per utensili manuali azionati elettricamente

source: Machines for comminuting
it: Macchine sminuzzatrici

source: Guidance frameworks for cutting tools [machine]
it: Telai guida per utensili da taglio [macchine]

source: Hydraulic valve actuators
it: Attuatori idraulici di valvole

source: Industrial robots
it: Robot industriali

source: Bearings [parts of machines]
it: Cuscinetti [parti di macchine]
